[
    {
        "name": "Safi",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1001,
        "dangerous": 5,
        "isFeatured": true,
        "isFavorite": true,
        "state": "Marrakesh-Safi",
        "coordinates": {
            "longitude": -9.2366,
            "latitude": 32.3101
        },
        "description": "Safi or Asfi (Arabic: آسفي, romanized: ʾāsafī; Berber languages: ⴰⵙⴼⵉ, romanized: asfi) is a city in western Morocco on the Atlantic Ocean. It is the capital of Asfi Province. It recorded a population of 308,508 in the 2014 Moroccan census. The city was occupied by the Portuguese Empire from 1488 to 1541, was the center of Morocco's weaving industry, and became a fortaleza of the Portuguese Crown in 1508. Safi is the main fishing port for the country's sardine industry, and also exports phosphates, textiles and ceramics. During the Second World War, Safi was the site of Operation Blackstone, one of the landing sites for Operation Torch.",
        "imageName": "Safi"
    },
    {
        "name": "Essaouira",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1002,
        "dangerous": 5,
        "isFeatured": false,
        "isFavorite": false,
        "state": "Marrakesh-Safi",
        "coordinates": {
            "longitude": -9.759504,
            "latitude": 31.508493
        },
        "description": "Essaouira (/ˌɛsəˈwɪərə/ ESS-ə-WEER-ə; Arabic: الصويرة, romanized: aṣ-Ṣawīra; Tachelhit: ⵜⴰⵚⵚⵓⵔⵜ, romanized: Taṣṣort, formerly ⴰⵎⴳⴷⵓⵍ Amegdul), known until the 1960s as Mogador, is a port city in the western Moroccan region of Marakesh-Safi, on the Atlantic coast. It has 77,966 inhabitants as of 2014. The foundation of the city of Essaouira was the work of the Moroccan 'Alawid sultan Mohammed bin Abdallah, who made an original experiment by entrusting it to several renowned architects in 1760, in particular Théodore Cornut and Ahmed al-Inglizi, who designed the city using French captives from the failed French expedition to Larache in 1765, and with the mission of building a city adapted to the needs of foreign merchants. Once built, it continued to grow and experienced a golden age and exceptional development, becoming the country's most important commercial port but also its diplomatic capital between the end of the 18th century and the first half of the 19th century.",
        "imageName":"Essaouira"
    },
    {
        "name": "Taghazout",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1003,
        "dangerous": 5,
        "isFeatured": false,
        "isFavorite": true,
        "state": "Souss-Massa",
        "coordinates": {
            "longitude": -9.708638,
            "latitude": 30.545008
        },
        "description": "Taghazout (Berber: ⵜⴰⵖⴰⵣⵓⵜ, Taɣazut; Arabic: تاغازوت) is a small fishing village 19 km (12 mi) north of the city of Agadir in southwestern Morocco. The inhabitants are mostly of Berber origin. Fishing, tourism, and the production of Argan oil being the main source of income. In recent years, tourism has been increasing in importance to the local economy and it is a popular surfing destination.",
        "imageName":"TaghazoutSwift"
    },
    {
        "name": "Agadir",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1004,
        "dangerous": 5,
        "isFeatured": true,
        "isFavorite": true,
        "state": "Souss-Massa",
        "coordinates": {
            "longitude": -9.598107,
            "latitude": 30.427755
        },
        "description": "Agadir (Arabic: أݣادير, romanized: ʾagādīr; Tachelhit: ⴰⴳⴰⴷⵉⵔ) is a major city in Morocco, on the shore of the Atlantic Ocean near the foot of the Atlas Mountains, just north of the point where the Souss River flows into the ocean, and 509 kilometres (316 mi) south of Casablanca. Agadir is the capital of the Agadir Ida-U-Tanan Prefecture and of the Souss-Massa economic region. The majority of its inhabitants speak Berber, one of Morocco's two official languages. Agadir is one of the major urban centres of Morocco. The municipality of Agadir recorded a population of 924,000 in the 2014 Moroccan census.[1] According to the 2004 census, there were 346,106 inhabitants in that year[2] and the population of the Prefecture of Agadir-Ida Outanane was 487,954 inhabitants.[2] Three languages are spoken in the city: Tashelhit (first language of the majority), Moroccan Arabic, and French.",
        "imageName": "Agadir"
    },
    {
        "name": "Anza",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1005,
        "dangerous": 5,
        "isFeatured": false,
        "isFavorite": false,
        "state": "Souss-Massa",
        "coordinates": {
            "longitude": -9.653625,
            "latitude": 30.454308
        },
        "description": "Anza, a small village of fishermen, or the welcoming people and their booming surf culture make this place the perfect place to Unforgettable holidays. The Anza surf spot is one of the most consistent and regular in the region and depending on the conditions it can be the perfect place to learn surfing or enjoy the high waves level.",
        "imageName": "Anza"
    },
    {
        "name": "Tamraght and Aourir",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1006,
        "dangerous": 5,
        "isFeatured": false,
        "isFavorite": false,
        "state": "Souss-Massa",
        "coordinates": {
            "longitude": -9.677297,
            "latitude": 30.511005
        },
        "description": "The fishing village of Taghazout and the area of ​​Aourir and Tamraght, are today considered the best surfing area for pros and beginners. The village of Taghazout, by the roadside, remains authentic despite the culture – heavy surfing. The main beach is ideal for swimming, but during and after the summer holidays, the influx of tourists can sometimes surprise. The villages of Aourir and Tamraght, are obligatory passages when you make your excursions in the hinterland (Paradise Valley and Arganeraie Reserve) and will be a good plan to take your lunch break when you are on your way to Tamri or Imsouane. Between Taghazout and Tamraght in the South, you will discover the impressive seaside resort of Taghazout Bay with its modern architecture but which has managed to preserve the variety of landscapes that the region can offer and the relaxed atmosphere of Taghazout. This area now offers all sports activities (numerous surf schools, golf, equestrian club, tennis, football, mountain biking, trekking, skate park and adventure park, etc.).",
        "imageName": "Tamraght"
    },
    {
        "name": "Tamri",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1007,
        "dangerous": 5,
        "isFeatured": true,
        "isFavorite": false,
        "state": "Souss-Massa",
        "coordinates": {
            "longitude": -9.834815,
            "latitude": 30.682876
        },
        "description": "Tamri is a small town and rural commune in Agadir-Ida Ou Tanane Prefecture, Souss-Massa, Morocco. At the time of the 2004 census, the commune had a total population of 17,442 people living in 2927 households.Tamri-Beach is a surf surf spot located in Imsouane in Morocco. Tamri-Beach is a river break and produces both lefts and rights suitable for experienced and expert surfers. The optimal conditions for surfing Tamri-Beach are easterly winds and a northwesterly swell.",
        "imageName": "Tamri"
    },
    {
        "name": "Imsouane",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1008,
        "dangerous": 5,
        "isFeatured": false,
        "isFavorite": false,
        "state": "Souss-Massa",
        "coordinates": {
            "longitude": -9.816285,
            "latitude": 30.841489
        },
        "description": "Imsouane, this small surfing paradise, long kept 'secret' (for its unique waves and spots), a thousand miles from the seaside resorts of Agadir, Essaouira or Taghazout (complete guides to discover these last 2 online too! ), was therefore the ideal destination. And I confirm, if you dream of a quiet place, where your life is punctuated by the ocean, the waves and the tides, the bay of Imsouane is likely to please you a lot.",
        "imageName": "Imsouane"
    },
    {
        "name": "Sidi Kouaki",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1009,
        "dangerous": 5,
        "isFeatured": false,
        "isFavorite": false,
        "state": "Marrakech-Tensift-Al Haouz",
        "coordinates": {
            "longitude": -9.797151,
            "latitude": 31.351419
        },
        "description": "Ocean Vibes Morocco is located in Sidi Kaouki and has 7 of the best surf spots within a distance of 7km max. We have put together a short list of the best spots in Morocco between Essaouira and Agadir, around Sidi Kaouki, starting from North to South: Asafi Beach (Asafi): Spot that works with a southerly wind. An accessible beachbreak for all levels. And surfable spot when it's flat in the other spots of Essaouira, Agadir. La Grotte (Cap Sim): The cave is one of the best spots in Morocco with Imsouane according to us. Long tubes on the right, recommended level: Intermediate - pro. La Couronne (Cap Sim): The longest wave in the area with a tube section. Longboarders will clearly find their pleasure there. Recommended level: Intermediate. Lanter (next to Cap Sim): Often a straight tube, recommended level: pro .Sidi Kaouki beach: Spot for all levels, right or left depending on the tide. Beach break with waves from 0.50m up to 3m. Marabout surf spot (Sidi Kaouki): Reefbreak with a wave on the right. Recommended level: Intermediate - pro La Bouteille (Sidi Kaouki): Reef break, perfect at low tide, waves from 0.8m to 1.60m in perfect conditions. Loued; la pointe (Sidi Kaouki): Wave in M, left - right. Beachbreak from 1m to 1.5m, perfect for long boards but also short boards and paddle. Works well in mid tide. Tafedna: A beautiful bay bounded by cliffs, a wave that works at low tide with a swell that can reach 2m. Surf in a beautiful setting. La Baie (Imsouane): Known to be the longest wave in Morocco! Wave to the right for one minute, perfect at low tide/mid tide. Perfect for all levels and a paradise for longboarders. La Cathédrale (Imsouane): Beachbreak that works at mid-tide/high tide, very nice ring for all levels and all types of boards.There is something for everyone, but they are all worth the detour. Sidi Kaouki is located in the middle of these different places, Ocean Vibes Morocco forms the ideal starting point. We have all the gear you need, including straps to carry the boards.",
        "imageName": "sidikouaki"
    },
    {
        "name": "Dakhla",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1010,
        "dangerous": 5,
        "isFeatured": false,
        "isFavorite": false,
        "state": "Dakhla-Oued Ed-Dahab",
        "coordinates": {
            "longitude": -15.937042,
            "latitude": 23.710867
        },
        "description": "The best surf spots in Dakhla Morocco are Foum Labouir, Aarcih, and Sarga. When is the best time for a surf trip to Dakhla in Morocco? The best time to come and surf the waves of Dakhla in Morocco is from November to March. The dozens of surf camps and kite camps located in Dakhla will perfectly meet your needs. Between desert and ocean, the different spots of this peninsula are blessed by constant winds, offering optimal conditions for all levels.",
        "imageName": "Dakhla"
    },
    {
        "name": "Oualidia",
        "country": "Morocco",
        "continent": "North Africa",
        "id": 1011,
        "dangerous": 5,
        "isFeatured": false,
        "isFavorite": false,
        "state": "Casablanca-Settat",
        "coordinates": {
            "longitude": -9.0295,
            "latitude": 32.7362
        },
        "description": "Oualidia in Central Morocco is a sheltered beach and reef break that has reasonably consistent surfing. Offshore winds are from the southeast. The optimum well angle is from the northwest. The beach break offers both left and right hand waves and there are also left and right hand reef breaks on offer.. The quality of the surf isn't affected by the tide. When it's working here, it can get crowded. Hazards include . This former fishing village has on the one hand a superb beach and reef break with lefts and rights and a marvelous lagoon. It is nicknamed 'the blue pearl of Morocco'. It is a beach of blond and fine sand protected by a bay of rock and which then extends into a lagoon.",
        "imageName": "Oualidia"
    }
]
